# 1.	Какой тип данных используется для хранения целых чисел в Python?
# a. int
#
# 2.	Какой тип данных используется для хранения вещественных чисел в Python?
# b. float
#
# 3.	Какой тип данных используется для хранения строк в Python?
# c. str
#
# 4.	Какая операция используется для объединения двух строк в Python?
# a. +
#
# 5.	Какой оператор используется для проверки равенства значений в Python?
# b. ==
#
# 6.	Какой оператор используется для проверки больше или меньше значения в Python?
# d. <>
#
# 7.	Какой оператор используется для проверки, входит ли элемент в список в Python?
# a. in
#
# 8.	Какой оператор используется для проверки, является ли элемент частью строки в Python?
# a. in
#
# 9.	Какой оператор используется для создания условия if в Python?
# a. if
#
# 10.	Какой оператор используется для выхода из цикла в Python?
#  a. break
#
# 11.	Какой оператор используется для продолжения выполнения цикла в Python?
# b. continue
#
# 12.	Какой оператор используется для получения элемента списка по индексу в Python?
# d. none of the above
#
# 13.	Какой оператор используется для добавления элемента в конец списка в Python?
# c. append()
#
# 14.	Какой оператор используется для удаления элемента из списка в Python?
# b. remove()
# c. pop()
#
# 15.	Какой оператор используется для получения длины списка в Python?
# d. len()
#
# 16.	 Что будет результатом программы и почему?
# x = 4.5
# y = 2
# print(x // y)
# Ответ: результатом будет 2.0, так как используется оператор целочисленного деления, без остатка
#
# 17.	 Какая будет итоговая длина списка и почему?
# a = [1 ,2 ,3, None, (), [] , ]
# print(len(a))
# Ответ: результатом будет 6, так как None, пустой список [] и пустой кортеж () тоже элементы списка.
#        Поэтому проверяя длину списка оператором len насчитает 6 элементов списка.
#        После последней запятой ничего не указано, поэтому седьмого элемента не будет.
#
# 18.	Какой будет результат программы?
# x = True
# y = False
# z = False
# if not x or y:
#     print(1)
# elif not x or not y and z:
#     print(2)
# elif not x or y or not y and x:
#     print(3)
# else:
#     print(4)
# Ответ: Результатом будет 3, так как сработало условие not x or y or not y and x. Первая часть (not x or y)
#        не выполняет условие, но выполняет условие вторая часть (not y and x). И так как между ними
#        стоит оператор 'or', то это условие выполняется.
#
# 19.	Что выведет следующий код, при его исполнении?
# print(type(1 / 2))
# Ответ: <class 'float'> (вещественный тип данных). Вначале произойдёт деление чисел,
#        а потом определиться тип данных полученного результата
#
# 20.	Какие из приведенных ниже имен переменных не корректны?
# a. my-var  d. _myvar

